---
kind: property
id: P:Autodesk.Revit.DB.MEPCurveType.Roughness
source: html/fc36ea5c-e146-394a-3bb4-e1f001623117.htm
---
# Autodesk.Revit.DB.MEPCurveType.Roughness Property

The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness

## Syntax (C#)
```csharp
public double Roughness { get; set; }
```